---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLConditionType
source: html/261d68d1-c613-a942-ce91-285322dec156.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLConditionType

This enumeration corresponds to the conditionType attribute in gbXML.
 The enumerated attribute identifies the type of heating, cooling,
 or ventilation the space has.

## Syntax (C#)
```csharp
public enum gbXMLConditionType
```